In [1]:
import numpy as np
import pandas as pd

In [10]:
date = pd.read_csv(r"C:\Users\Asus\OneDrive\Desktop\Dataset\orders.csv")
time  = pd.read_csv(r"C:\Users\Asus\OneDrive\Desktop\Dataset\messages.csv")

In [12]:
date.head(3)

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1

In [13]:
time.head(3)

                  date                                               msg
0  2013-12-15 00:50:00                          ищу на сегодня мужика 37
1  2014-04-29 23:40:00  ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00          Днепр.м 43 позн.с д/ж *.о  067.16.34.576

# Date and Time

In [7]:
date.info()
# date and time into the object format
# so what we have to do we have to converted into the integer format

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [14]:
time.info()
# date are int the object format so we have to converted into the integer format

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with Dates

In [16]:
date['date'] = pd.to_datetime(date['date'])

In [17]:
date

          date  product_id  city_id  orders
0   2019-12-10        5628       25       3
1   2018-08-15        3646       14     157
2   2018-10-23        1859       25       1
3   2019-08-17        7292       25       1
4   2019-01-06        4344       25       3
..         ...         ...      ...     ...
995 2018-10-08         255       13       1
996 2018-12-06        5521        7       1
997 2019-05-07         487       26      14
998 2019-03-03        1503       21       2
999 2019-10-15        6371        7      22

[1000 rows x 4 columns]

In [20]:
date.info()
# see the date time converted into the date time 64

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

# lets extract year

In [21]:
date['date_year'] = date['date'].dt.year

date.sample()

          date  product_id  city_id  orders  date_year
428 2018-07-14        4183       22       8       2018

# exctract month

In [22]:

date["date_month"] = date['date'].dt.month

In [23]:
date.sample(4)

          date  product_id  city_id  orders  date_year  date_month
182 2019-05-26        1135       28       1       2019           5
85  2019-11-13        5288       18       7       2019          11
43  2018-09-04        2490        7       1       2018           9
585 2018-07-16        5738       13      39       2018           7

# exctract date

In [24]:
date['date_from_date'] = date['date'].dt.month

In [28]:
# or also you can do month name
date['date_from_month'] = date['date'].dt.month_name()

In [29]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_from_date,date_from_month
0,2019-12-10,5628,25,3,2019,12,12,December
1,2018-08-15,3646,14,157,2018,8,8,August
2,2018-10-23,1859,25,1,2018,10,10,October
3,2019-08-17,7292,25,1,2019,8,8,August
4,2019-01-06,4344,25,3,2019,1,1,January

# Exctract days

In [32]:
date['wich_day_of_month'] = date['date'].dt.day

In [33]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_from_date,date_from_month,wich_day_of_month
0,2019-12-10,5628,25,3,2019,12,12,December,10
1,2018-08-15,3646,14,157,2018,8,8,August,15
2,2018-10-23,1859,25,1,2018,10,10,October,23
3,2019-08-17,7292,25,1,2019,8,8,August,17
4,2019-01-06,4344,25,3,2019,1,1,January,6

In [35]:
# day of week
date['week_of_month_ofthat day'] = date['date'].dt.dayofweek

In [36]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_from_date,date_from_month,wich_day_of_month,week_of_month_ofthat day
0,2019-12-10,5628,25,3,2019,12,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,1,January,6,6

In [37]:
date.drop(columns = ["product_id","city_id","orders"],inplace = True)

In [41]:
# day of week
date['day_of_week'] = date['date'].dt.day_name()
# its weired your days start from the tuesdday ,wednesaday

In [42]:
date.head()

,date,date_year,date_month,date_from_date,date_from_month,wich_day_of_month,week_of_month_ofthat day,day_of_week
0,2019-12-10,2019,12,12,December,10,1,Tuesday
1,2018-08-15,2018,8,8,August,15,2,Wednesday
2,2018-10-23,2018,10,10,October,23,1,Tuesday
3,2019-08-17,2019,8,8,August,17,5,Saturday
4,2019-01-06,2019,1,1,January,6,6,Sunday

# is week day or not

In [47]:

date['date_of_weekend'] = np.where(date['day_of_week'].isin(['Sunday','Saturday']),1,0)
date.head()

,date,date_year,date_month,date_from_date,date_from_month,wich_day_of_month,week_of_month_ofthat day,day_of_week,date_of_weekend
0,2019-12-10,2019,12,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,1,January,6,6,Sunday,1

# Exctract week of the year

In [51]:
date['date_week'] = date['date'].dt.week

C:\Users\Asus\AppData\Local\Temp/ipykernel_20756/3869037006.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  date['date_week'] = date['date'].dt.week

In [52]:
date.head()

,date,date_year,date_month,date_from_date,date_from_month,wich_day_of_month,week_of_month_ofthat day,day_of_week,date_of_weekend,date_week
0,2019-12-10,2019,12,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,1,January,6,6,Sunday,1,1

# Exctract Quarter

In [54]:
date['quarter'] = date['date'].dt.quarter
date.head()

,date,date_year,date_month,date_from_date,date_from_month,wich_day_of_month,week_of_month_ofthat day,day_of_week,date_of_weekend,date_week,quarter
0,2019-12-10,2019,12,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,2019,8,8,August,17,5,Saturday,1,33,3
4,2019-01-06,2019,1,1,January,6,6,Sunday,1,1,1

# Exctract semester

In [57]:
date['semester'] = np.where(date['quarter'].isin([1,2]),1,2)
date.head()

,date,date_year,date_month,date_from_date,date_from_month,wich_day_of_month,week_of_month_ofthat day,day_of_week,date_of_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,1,January,6,6,Sunday,1,1,1,1

# Exctract times elasped between dates

In [58]:
import datetime
today = datetime.datetime.today()
today

datetime.datetime(2022, 8, 24, 22, 29, 56, 174819)

In [59]:
today - date['date']

0      988 days 22:29:56.174819
1     1470 days 22:29:56.174819
2     1401 days 22:29:56.174819
3     1103 days 22:29:56.174819
4     1326 days 22:29:56.174819
                 ...
995   1416 days 22:29:56.174819
996   1357 days 22:29:56.174819
997   1205 days 22:29:56.174819
998   1270 days 22:29:56.174819
999   1044 days 22:29:56.174819
Name: date, Length: 1000, dtype: timedelta64[ns]

In [60]:
(today - date['date']).dt.days

0       988
1      1470
2      1401
3      1103
4      1326
       ...
995    1416
996    1357
997    1205
998    1270
999    1044
Name: date, Length: 1000, dtype: int64

# Month passed

In [62]:
np.round((today - date['date'])/np.timedelta64(1, 'M'),0)

0      32.0
1      48.0
2      46.0
3      36.0
4      44.0
       ...
995    47.0
996    45.0
997    40.0
998    42.0
999    34.0
Name: date, Length: 1000, dtype: float64

In [63]:
((today - date['date'])/np.timedelta64(1, 'M'),0)

(0      32.491425
 1      48.327480
 2      46.060493
 3      36.269737
 4      43.596376
          ...
 995    46.553316
 996    44.614878
 997    39.620935
 998    41.756503
 999    34.331299
 Name: date, Length: 1000, dtype: float64,
 0)

# lets discuss about the time

In [64]:
time

                    date                                                msg
0    2013-12-15 00:50:00                           ищу на сегодня мужика 37
1    2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2    2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3    2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4    2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
..                   ...                                                ...
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

[1000 rows x 2 columns]

In [65]:
time['date']=pd.to_datetime(time['date'])

In [66]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [67]:
time['hour'] = time['date'].dt.hour
time['min'] =  time['date'].dt.minute
time['sec'] =  time['date'].dt.second

In [68]:
time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

# exctract timepart

In [69]:
time['date_time'] = time['date'].dt.time

In [70]:
time.head(2)

,date,msg,hour,min,sec,date_time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00

# timedifference

In [71]:
today-time['date']

0     3174 days 21:39:56.174819
1     3038 days 22:49:56.174819
2     3524 days 22:08:56.174819
3     2826 days 21:58:56.174819
4     3223 days 23:18:56.174819
                 ...
995   3813 days 21:39:56.174819
996   3134 days 23:15:56.174819
997   3599 days 22:52:56.174819
998   3715 days 22:55:56.174819
999   2987 days 23:04:56.174819
Name: date, Length: 1000, dtype: timedelta64[ns]

In [72]:
# in seconds
(today - time['date'])/np.timedelta64(1,'s')

0      2.743116e+08
1      2.625654e+08
2      3.045533e+08
3      2.442455e+08
4      2.785511e+08
           ...
995    3.295212e+08
996    2.708614e+08
997    3.110360e+08
998    3.210586e+08
999    2.581599e+08
Name: date, Length: 1000, dtype: float64

In [73]:
# in _minutes\
(today - time['date'])/np.timedelta64(1,'m')

0      4.571860e+06
1      4.376090e+06
2      5.075889e+06
3      4.070759e+06
4      4.642519e+06
           ...
995    5.492020e+06
996    4.514356e+06
997    5.183933e+06
998    5.350976e+06
999    4.302665e+06
Name: date, Length: 1000, dtype: float64

In [74]:
(today - time['date'])/np.timedelta64(1,'h')

0      76197.665604
1      72934.832271
2      84598.148937
3      67845.982271
4      77375.315604
           ...
995    91533.665604
996    75239.265604
997    86398.882271
998    89182.932271
999    71711.082271
Name: date, Length: 1000, dtype: float64